/*
1120：同行列对角线的格

时间限制: 1000 ms         内存限制: 65536 KB
提交数: 69523     通过数: 30086
【题目描述】
输入三个自然数n
，i
，j（1≤i≤n，1≤j≤n）
，输出在一个n×n
格的棋盘中(行列均从1
开始编号)，与格子(i
，j
)同行、同列、同一对角线的所有格子的位置。

如：n=4
，i=2
，j=3
表示了棋盘中的第二行第三列的格子，

当n=4
，i=2
，j=3
时，输出的结果是：

(2,1) (2,2) (2,3) (2,4)              同一行上格子的位置

(1,3) (2,3) (3,3) (4,3)              同一列上格子的位置

(1,2) (2,3) (3,4)                    左上到右下对角线上的格子的位置

(4,1) (3,2) (2,3) (1,4)              左下到右上对角线上的格子的位置

【输入】
一行，三个自然数n
，i
，j
，相邻两个数之间用单个空格隔开(1≤n≤10
)。

【输出】
第一行：从左到右输出同一行格子位置；

第二行：从上到下输出同一列格子位置；

第三行：从左上到右下输出同一对角线格子位置；

第四行：从左下到右上输出同一对角线格子位置。

其中每个格子位置用如下格式输出：(x
,y
)，x
为行号，y
为列号，采用英文标点，中间无空格。相邻两个格子位置之间用单个空格隔开。

【输入样例】
4 2 3
【输出样例】
(2,1) (2,2) (2,3) (2,4)
(1,3) (2,3) (3,3) (4,3)
(1,2) (2,3) (3,4)
(4,1) (3,2) (2,3) (1,4)
*/
#include <stdio.h>

int main()
{
	int n, i, j;
	scanf("%d %d %d", &n, &i, &j);
	for (int k = 1; k <= n; k++)
	{
		printf("(%d,%d) ", i, k);
	}
	printf("\n");
	for (int k = 1; k <= n; k++)
	{
		printf("(%d,%d) ", k, j);
	}
	printf("\n");
	for (int x = 1; x <= n; x++)
	{
		for (int y = 1; y <= n; y++)
		{
			if (x - y == i - j)
			{
				printf("(%d,%d) ", x, y);
			}
		}
	}
	printf("\n");
	for (int x = n; x > 0; x--)
	{
		for (int y = n; y > 0; y--)
		{
			if (x + y == i + j)
			{
				printf("(%d,%d) ", x, y);
			}
		}
	}
	return 0;
}

//int main()
//{
//	int n, i, j, x, y;
//	scanf("%d %d %d", &n, &i, &j);
//	x = i;
//	y = j;
//	for (int k = 1; k <= n; k++)
//	{
//		printf("(%d,%d) ", i, k);
//	}
//	printf("\n");
//	for (int k = 1; k <= n; k++)
//	{
//		printf("(%d,%d) ", k, j);
//	}
//	printf("\n");
//	while (--x > 0 && --y > 0);
//	while (x <= n && y <= n)
//	{
//		printf("(%d,%d) ", ++x, y++);
//	}
//	y--;
//	printf("\n");
//	x = i;
//	y = j;
//	while (++x <= n && --y > 0);
//	while (x > 0 && y <= n)
//	{
//		printf("(%d,%d) ", --x, y++);
//	}
//	return 0;
//}