/*

1128：图像模糊处理

时间限制: 1000 ms         内存限制: 65536 KB
提交数: 60549     通过数: 26213
【题目描述】
给定n
行m
列的图像各像素点的灰度值，要求用如下方法对其进行模糊化处理：

1.四周最外侧的像素点灰度值不变；

2.中间各像素点新灰度值为该像素点及其上下左右相邻四个像素点原灰度值的平均(舍入到最接近的整数)。

【输入】
第一行包含两个整数n
和m
，表示图像包含像素点的行数和列数。1≤n≤100，1≤m≤100
。

接下来n
行，每行m
个整数，表示图像的每个像素点灰度。相邻两个整数之间用单个空格隔开，每个元素均在0∼255
之间。

【输出】
n
行，每行m
个整数，为模糊处理后的图像。相邻两个整数之间用单个空格隔开。

【输入样例】
4 5
100 0 100 0 50
50 100 200 0 0
50 50 100 100 200
100 100 50 50 100
【输出样例】
100 0 100 0 50
50 80 100 60 0
50 80 100 90 200
100 100 50 50 100
*/
#include <stdio.h>

int main()
{
	int m, n, matrix[100][100];
	double result[100][100];
	scanf("%d %d", &m, &n);
		for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			scanf("%d", &matrix[i][j]);
			result[i][j] = matrix[i][j];
		}
	}
	for (int i = 1; i < m - 1; i++)
	{
		for (int j = 1; j < n - 1; j++)
		{
			result[i][j] += matrix[i + 1][j] + matrix[i - 1][j] + matrix[i][j + 1] + matrix[i][j - 1];
			result[i][j] /= 5;
		}
	}
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			printf("%.0lf ", result[i][j]);
		}
		printf("\n");
	}
	return 0;
}