/*
2041：【例5.9】新矩阵

时间限制: 1000 ms         内存限制: 65536 KB
提交数: 55576     通过数: 26778
【题目描述】
已知一个n×n(2≤n≤20)
的矩阵（方阵），把矩阵二条对角线上的元素值加上10
，然后输出这个新矩阵。

【输入】
第一行为n
;

下面为一个n×n
，矩阵中各正整数小于100
。

【输出】
输出新的矩阵。共n
行，每行n
数，各数之间用一个空格隔开。

【输入样例】
5
13 66 53 89 55
11 72 61 62 46
90 10 38 10 55
95 20 43 27 19
60 12 66 16 96
【输出样例】
23 66 53 89 65 
11 82 61 72 46 
90 10 48 10 55 
95 30 43 37 19 
70 12 66 16 106
*/
#include<stdio.h>

int main()
{
	int arr[20][20], n;
	scanf("%d", &n);
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			scanf("%d", &arr[i][j]);
			if (i == j || i == n - j - 1)
			{
				arr[i][j] += 10;
			}
		}
	}
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}
